print("Введите первое число: ")  # с новой строки
a = input()
b = input("Введите второе число: ")  # правее
print(a, " + ", b, " = ", a + b)    # если а = 3 и b = 4 то будет 34, а если перед input добавить int то будет 7

# c = 5.89
# print(c)
# print(type(c))
# c = int(c)      # вместо int можем str, тогда если с + 892 будет 5.89892
# print(type(c))

# c = 1
# c = bool(c)  # выведет true
# print(c)

# a = 1.43425
# b = 2.2983
# print(a * b)
# c = round(a * b, 5) # round принимает а вход 2 арг, 1 число, 2 кол-во чисел после запятой
# print(c)